# SpaceSetIterator Properties

---
The SpaceSetIterator type exposes the following members.
| Name| Description
---|---|---
| Current| Retrieves the item that is the current focus of the iterator.
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
Top
#### Reference
SpaceSetIterator Class
Autodesk.Revit.DB.Mechanical Namespace